doc/white-paper-nov19.org
#+TITLE: Adding .NET support to PostgreSQL
#+AUTHOR: Brick Abode
#+DATE: Thu Nov  7 11:02:10 -03 2019

* Introduction

PostgreSQL[fn:1] (also "Postgres") is a leading open-source relational
database.  Postgres allows user functions to be written in C[fn:2]
(the implementation language) and SQL[fn:3] (the native language of
the database itself), but it also allows user-defined functions to be
written in other languages, generically called Procedural Languages[fn:4].
These languages currently include Tcl[fn:5], Perl[fn:6], and Python[fn:7]
in the main distribution, and Java[fn:8], Ruby[fn:9], Lua[fn:10],
R[fn:11], Javascript[fn:12], and Unix shell[fn:13], hosted outside of
the main distribution.

We have added Microsoft's .NET framework to PostgreSQL.  Both
PostgreSQL[fn:50] and .NET Core[fn:55] are available under Berkeley-style
licenses, and so is our work.

Our work is preliminary, and it is going very well.  We have made an
initial, alpha-quality release, along with this white paper, in order
to spread awareness and seek feedback on the project.  We anticipate
making our first full release in January of 2020.

We will fully support both the C#[fn:60] and F#[fn:63] languages, and support for
other .NET languages such as Visual Basic[fn:66] should be straightforward if
interest arises.

This paper describes our motivation for the project, the initial feature
set of both this Alpha release as well as version 1, our experience
thus far, and our future plans, including our hopes of cooperating
with other PostgreSQL Procedural Language implementations.

