doc/white-paper-nov19.html

<div id="outline-container-org90fd288" class="outline-2">
<h2 id="org90fd288"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
We at Brick Abode love strongly-typed functional programming, and we are
commercial software developers.  We have embraced .NET as a platform
because it combines a powerful application development environment
(especially ASP.NET and related web-based application solutions) with
a powerful, typed functional programming language, F#.
</p>

<p>
We build most of our internal applications on F#, and we use it for some
client project as well, where appropriate.  We also do a great deal of
C# development for clients.
</p>

<p>
We also are heavy users of PostgreSQL.  Members of our team have
previously done heavy work on the internals of the database, and it
has played a central role in our creation of highly-secured financial
applications.
</p>

<p>
As part of that security work, we have wished for the ability to move
certain functionality from the application to the database, and having
C# and F# as PostgreSQL Procedural Languages will make that possible.
We then can tightly restrict database access to the main part of the code,
significantly reducing the danger of any security intrusions that might
occur there.  (This is part of a broader architecture of multi-layered
security protections.)
</p>

<p>
Securing this particular application was our original motivation, but
as we explored the idea, we grew more enthusiasm for the project for
other reasons as well:
</p>

<ol class="org-ol">
<li>Move computation to data
<ul class="org-ul">
<li>requires SDLC support</li>
<li>creates SDLC possibilities!</li>
</ul></li>
<li>Security
<ul class="org-ul">
<li>tied to SDLC</li>
</ul></li>
<li>Functional database programming
<ul class="org-ul">
<li>we want OCaml with good threading and a strong library</li>
<li>hey, look, we have it!  It's called F#!</li>
<li>A good ML, ML types, strong system library, amazing runtime</li>
<li>relational databases are already fairly functional-friendly environments, and now we can explore further in that direction</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org35e4a45" class="outline-2">
<h2 id="org35e4a45"><span class="section-number-2">3</span> Initial feature set</h2>
<div class="outline-text-2" id="text-3">
<p>
Because we are making this preliminary release of the software, the
initial features are broken into two sets: those which are currently
working, and those which are currently underway and will be working in
version 1.  We describe them separately.
</p>
</div>

<div id="outline-container-org59c37ee" class="outline-3">
<h3 id="org59c37ee"><span class="section-number-3">3.1</span> Current (Alpha) Implementation</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org3ca0dab" class="outline-4">
<h4 id="org3ca0dab"><span class="section-number-4">3.1.1</span> Data types and "System.Nullable"</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
We currently have working and tested booleans, integers, floating point
numbers, and text.  We also have mapped each of these types to the
"nullable" construct in C# ("System.Nullable&lt;T&gt;" in .NET.)  We will
describe each of these in turn.
</p>

<ul class="org-ul">
<li>base types:
<ul class="org-ul">
<li>booleans</li>
<li>numerics (int &amp; float)</li>
<li>strings</li>
</ul></li>
<li>nullable types</li>
</ul>
</div>
</div>

<div id="outline-container-org9ef8e63" class="outline-4">
<h4 id="org9ef8e63"><span class="section-number-4">3.1.2</span> Compilation</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>compiler and Roslyn</li>
<li>functions and DO</li>
</ul>
</div>
</div>

<div id="outline-container-org31adc5e" class="outline-4">
<h4 id="org31adc5e"><span class="section-number-4">3.1.3</span> Languages</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>C#: full; F#: proof-of-concept</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org17a24b6" class="outline-3">
<h3 id="org17a24b6"><span class="section-number-3">3.2</span> Imminent, Version 1 Implementation</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org3ea3b4e" class="outline-4">
<h4 id="org3ea3b4e"><span class="section-number-4">3.2.1</span> Structures ("Composites" in PostgreSQL)</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
"A composite type represents the structure of a row or record; it is
essentially just a list of field names and their data types. PostgreSQL
allows composite types to be used in many of the same ways that simple
types can be used. For example, a column of a table can be declared to
be of a composite type."
</p>
</div>
</div>

<div id="outline-container-org92c2803" class="outline-4">
<h4 id="org92c2803"><span class="section-number-4">3.2.2</span> Arrays</h4>
</div>
<div id="outline-container-orgf1581fe" class="outline-4">
<h4 id="orgf1581fe"><span class="section-number-4">3.2.3</span> SPI</h4>
</div>
<div id="outline-container-org5b055f7" class="outline-4">
<h4 id="org5b055f7"><span class="section-number-4">3.2.4</span> Full F# support</h4>
</div>
<div id="outline-container-org752d0cc" class="outline-4">
<h4 id="org752d0cc"><span class="section-number-4">3.2.5</span> Testing</h4>
</div>
</div>
</div>

<div id="outline-container-org99f9aa8" class="outline-2">
<h2 id="org99f9aa8"><span class="section-number-2">4</span> Our experience thusfar</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>nullable</li>
<li>unicode</li>
<li>memory</li>
<li>compilation</li>
<li>security</li>
</ul>
</div>
</div>

<div id="outline-container-org129ea75" class="outline-2">
<h2 id="org129ea75"><span class="section-number-2">5</span> Future Plans</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga2e33dc" class="outline-3">
<h3 id="orga2e33dc"><span class="section-number-3">5.1</span> PostgreSQL features</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>other data types: 
<ul class="org-ul">
<li>binary</li>
<li>datetime</li>
<li>timezone</li>
<li>json</li>
<li>range</li>
<li>geometry</li>
<li>internet</li>
<li>bitstring</li>
</ul></li>
<li>security</li>
<li>triggers</li>
<li>exoterica
<ul class="org-ul">
<li>careful examination of function attributes</li>
<li>giving access to expression parse tree</li>
<li>exotic SPI</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbcdb9d8" class="outline-3">
<h3 id="orgbcdb9d8"><span class="section-number-3">5.2</span> Exploring more of the relevant .NET universe</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>SQL Server/CLR integration
<ul class="org-ul">
<li><a href="https://docs.microsoft.com/en-us/dotnet/framework/data/adonet/sql/introduction-to-sql-server-clr-integration">https://docs.microsoft.com/en-us/dotnet/framework/data/adonet/sql/introduction-to-sql-server-clr-integration</a></li>
<li>our intention is to generally be good .NET citizens and follow SQL Server's lead</li>
</ul></li>
<li>Entity Framework</li>
<li>Linq</li>
<li>ADO.NET</li>
</ul>
</div>
</div>

<div id="outline-container-org7636097" class="outline-3">
<h3 id="org7636097"><span class="section-number-3">5.3</span> Cross-PL community</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>cross-PL test suite</li>
<li>guide for future PL authors</li>
</ul>
</div>
</div>
</div>
