doc/white-paper-nov19.org
* Conclusions

[fn:1] [[https://www.postgresql.org/docs/current/index.html]]
[fn:2] [[https://www.postgresql.org/docs/current/plpgsql.html]]
[fn:3] [[https://www.postgresql.org/docs/current/xfunc-c.html]]
[fn:4] [[https://www.postgresql.org/docs/current/plhandler.html]]
[fn:5] [[https://www.postgresql.org/docs/current/pltcl.html]]
[fn:6] [[https://www.postgresql.org/docs/current/plperl.html]]
[fn:7] [[https://www.postgresql.org/docs/current/plpython.html]]
[fn:8] [[https://tada.github.io/pljava/]]
[fn:9] [[https://github.com/knu/postgresql-plruby]]
[fn:10] [[https://github.com/pllua/pllua]]
[fn:11] [[https://github.com/postgres-plr/plr]]
[fn:12] [[https://github.com/plv8/plv8]]
[fn:13] [[https://github.com/petere/plsh]]
[fn:50] [[https://www.postgresql.org/about/licence/]]
[fn:55] [[https://dotnet.microsoft.com/platform/free]]
[fn:60] [[https://en.wikipedia.org/wiki/C_Sharp_(programming_language)]]
[fn:63] [[https://en.wikipedia.org/wiki/F_Sharp_(programming_language)]]
[fn:66] [[https://en.wikipedia.org/wiki/Visual_Basic_.NET]]

