doc/white-paper-nov19.html

<div id="outline-container-org005c566" class="outline-2">
<h2 id="org005c566"><span class="section-number-2">6</span> Conclusions</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/index.html">https://www.postgresql.org/docs/current/index.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/plpgsql.html">https://www.postgresql.org/docs/current/plpgsql.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/xfunc-c.html">https://www.postgresql.org/docs/current/xfunc-c.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/plhandler.html">https://www.postgresql.org/docs/current/plhandler.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/pltcl.html">https://www.postgresql.org/docs/current/pltcl.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/plperl.html">https://www.postgresql.org/docs/current/plperl.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/docs/current/plpython.html">https://www.postgresql.org/docs/current/plpython.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
<a href="https://tada.github.io/pljava/">https://tada.github.io/pljava/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/knu/postgresql-plruby">https://github.com/knu/postgresql-plruby</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/pllua/pllua">https://github.com/pllua/pllua</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/postgres-plr/plr">https://github.com/postgres-plr/plr</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/plv8/plv8">https://github.com/plv8/plv8</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.13">13</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/petere/plsh">https://github.com/petere/plsh</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.14" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.14">14</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.postgresql.org/about/licence/">https://www.postgresql.org/about/licence/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.15" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.15">15</a></sup> <div class="footpara"><p class="footpara">
<a href="https://dotnet.microsoft.com/platform/free">https://dotnet.microsoft.com/platform/free</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.16" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.16">16</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/C_Sharp_(programming_language)">https://en.wikipedia.org/wiki/C_Sharp_(programming_language)</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.17" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.17">17</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/F_Sharp_(programming_language)">https://en.wikipedia.org/wiki/F_Sharp_(programming_language)</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.18" class="footnum" href="https://brickabode-zulip.s3.amazonaws.com/2/MpPF5e6PIs_N7LwGKjllSLKA/white-paper-nov19.html?Signature=ZasRlsE931oeWW1TubIwozzcL%2Fc%3D&amp;Expires=1573656134&amp;AWSAccessKeyId=AKIASJ5326WDWOQT7YXD#fnr.18">18</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Visual_Basic_.NET">https://en.wikipedia.org/wiki/Visual_Basic_.NET</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: Thu Nov  7 11:02:10 -03 2019</p>
<p class="author">Author: Brick Abode</p>
<p class="date">Created: 2019-11-13 Wed 11:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>